OdDAI.NamedType.m_typeCode
A smart pointer to the type code.

OdDAI.NamedType.m_whereRules
The list of Where rules associated with the named data type.

OdDAI.NamedType.m_parentSchema
A raw pointer to the schema object that contains the definition of the named data type.

OdDAI.NamedType.m_nameUpper
The upper case name of the data type.

OdDAI.NamedType.m_originalName
The original name of the data type.

OdDAI.NamedType.m_name
The name of the data type (always is represented in lower case).

OdDAI.NamedType.setNames(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Sets names (original name and name) for the named data type.
The original name is exactly the name that was defined within the .exp file.
Unlike the original name, the name is always represented in lower case.
\param name [in] An ANSI string that contains names to be set.

OdDAI.NamedType.appendWhereRule(OdDAI.WhereRule*)
\details
Appends a new Where Rule to the named type.
\param ruleDef [in] A raw pointer to the rule definition.

OdDAI.NamedType.whereRules
\details
Retrieves the list of Where Rules associated with the named type.
\returns A list of pointers to associated Where Rule objects.

OdDAI.NamedType.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of the attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns The current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.NamedType.type(std.shared_ptr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the type code for the named type.
\param typeCode [in] A smart pointer to the type code object to be set.

OdDAI.NamedType.type
\details
Retrieves a type code of the named type.
\returns A smart pointer to named type's type code.

OdDAI.NamedType.nameUpper
\details
Retrieves the name of the named type definition in upper case.
\returns An ANSI string that contains the name of the named type definition in upper case.

OdDAI.NamedType.originalName
\details
Retrieves the original name of the named type definition.
The original name is exactly the name that was defined within the .exp file.
Unlike the original name, the name is always represented in lower case.
\returns An ANSI string that contains the original name of the named type definition.

OdDAI.NamedType.name
\details
Retrieves the name of the named type definition.
The name is always represented in the lower case.
\returns An ANSI string that contains the name of the named type definition.

OdDAI.NamedType.parentSchema
\details
Retrieves the owner schema of the named type definition.
\returns A raw pointer to the owner schema of the named type definition.

OdDAI.NamedType.#ctor(OdDAI.Schema*,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new named type with specified parameters.
\param parentSchema [in] A raw pointer to a schema that contains the type declaration and definition.
\param name          [in] A name of the named type.

OdDAI.NamedType.#ctor
\details
Creates a new named type object with default parameters.

OdDAI.NamedType
\details
A class that implements the storing of the definition of a named type.